profile["joint"] = {

	description: "Joint suite",
	//53 digital
	digital: [["2 (○)", "2"], ["3 (○)", "3"], ["4 (●)", "4"], ["5 (○)", "5"], ["6 (●)", "6"], ["7 (○)", "7"], ["8 (●)", "8"], ["9 (○)", "9"], ["10 (●)", "10"], ["11 (●)", "11"], ["A0 (○)", "A0"], ["A1 (●)", "A1"], ["A2 (○)", "A2"], ["A3 (●)", "A3"]],
	//15 analog
	analog_read: [["A0 (○)", "A0"], ["A1 (●)", "A1"], ["A2 (○)", "A2"], ["A3 (●)", "A3"]],
	analog_write: [["3 (○)", "3"], ["5 (○)", "5"], ["6 (●)", "6"], ["9 (○)", "9"], ["10 (●)", "10"], ["11 (●)", "11"]],
	group_in: [["A0/A1", "A0_A1"], ["A2/A3", "A2_A3"]],
	group_out: [["3/11", "3_11"], ["5/6", "5_6"], ["9/10", "9_10"]],
	group_all: [["2/4", "2_4"], ["5/6", "5_6"], ["7/8", "7_8"], ["9/10", "9_10"], ["3/11", "3_11"], ["A0/A1", "A0_A1"], ["A2/A3", "A2_A3"]],
	serial: 9600
};

profile["jointlite"] = {
	description: "Joint lite suite",
	//53 digital
	//digital: [["输出分支(○)", "3"], ["输出分支(●)", "9"], ["输入分支(○)", "A0"], ["输入分支(●)", "A3"]],
	digital: [["输入", "A0"], ["输入分支(○)", "A0 "], ["输入分支(●)", "A3 "]],
	//15 analog
	analog_read: [["输入", "A0"], ["输入分支(○)", "A0 "], ["输入分支(●)", "A3 "]],
	analog_write: [["输出", "3"], ["输出分支(○)", "3 "], ["输出分支(●)", "9 "]],
	//analog_write: [[Blockly.Msg.JOINTLITE_OUTPUT,"3"],[Blockly.Msg.JOINTLITE_OUTPUTR, "3 "], [Blockly.Msg.JOINTLITE_OUTPUTL, "9 "]],
	liteRec: [["播音", "3_9"], ["录音", "9_3"]],
	group_in: [["输入", "A0_A3"]],
	group_out: [["输出", "3_9"]],
	group_all: [["输出", "3_9"], ["输入", "A0_A3"]],
	serial: 9600
};
